docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Index of Thom's Notes</title>
<meta name="author" content="Thomas" />
<meta name="description" content="Here is a collection of notes on various topics." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
<link rel="icon" type="image/png" sizes="48x48" href="img/favicon-48x48.png" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./"> HOME </a>
</div><div id="preamble" class="status">
Thom's Notes.
</div>
<div id="content" class="content">
<h1 class="title">Index of Thom&rsquo;s Notes</h1>
<p>
This is a collection of my notes on various topics. While I try to make them
useful for the public, the true target audiance is future self.
</p>

<div id="outline-container-orgae36ded" class="outline-2">
<h2 id="orgae36ded"><a href="2022-08-03-accounting-with-gnucash.html">Accounting with GnuCash</a></h2>
<div class="outline-text-2" id="text-orgae36ded">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-03 Sat&gt; </span></span> Notes on accounting and GnuCash.
</p>
<hr>
</div>
</div>
<div id="outline-container-org72cd1b2" class="outline-2">
<h2 id="org72cd1b2"><a href="2022-08-27-docker-cheat-sheet.html">Docker cheatsheet</a></h2>
<div class="outline-text-2" id="text-org72cd1b2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-27 Sat&gt; </span></span> Docker commands that comes handy very often.
</p>
<hr>
</div>
</div>
<div id="outline-container-org9b7ac05" class="outline-2">
<h2 id="org9b7ac05"><a href="2022-07-30-imagemagick-cheat-sheet.html">Imagemagick cheatsheet</a></h2>
<div class="outline-text-2" id="text-org9b7ac05">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-30 Sat&gt; </span></span> Some imagemagick commands that comes handy very often.
</p>
<hr>
</div>
</div>
<div id="outline-container-org726bd47" class="outline-2">
<h2 id="org726bd47"><a href="2022-07-20-domain-name-system.html">DNS - Domain Name System</a></h2>
<div class="outline-text-2" id="text-org726bd47">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-20 Wed&gt; </span></span> This is a post about why we need DNS, and how it works.
</p>
<hr>
</div>
</div>
<div id="outline-container-org133d273" class="outline-2">
<h2 id="org133d273"><a href="2022-07-18-bootstrapping-my-notes.html">Bootstrapping my notes</a></h2>
<div class="outline-text-2" id="text-org133d273">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-18 Mon&gt;  </span></span>  Story of how I ended up with my notes in org-mode.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thomas</p>
</div>
</body>
</html>
